; domain
(define (domain maze)
(:predicates
	 (at ?p ?t) (person ?p) (empty ?x) (wall ?x) (north ?a ?b) (south ?a ?b) (west ?a ?b) (east ?a ?b))

(:action move-north
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (north ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))
(:action move-south
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (south ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))
(:action move-west
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (west ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))
(:action move-east
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (east ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))


)

; problem
(define (problem simple_maze)
(:domain maze)
(:objects
	person1
	start_tile
	t0
	t1
	t2
	t3
	t4
	t5
	t6
	t7
	t8
	t9
	goal_tile
	)
(:init
	(empty start_tile)
	(empty t0)
	(empty t1)
	(empty t2)
	(empty t3)
	(empty t4)
	(empty t5)
	(empty t6)
	(empty t7)
	(empty t8)
	(empty t9)
	(empty goal_tile)
	(east start_tile t0)
	(west t0 start_tile)
	(east t0 t1)
	(west t1 t0)
	(east t1 t2)
	(west t2 t1)
	(east t2 t3)
	(west t3 t2)
	(east t3 t4)
	(west t4 t3)
	(east t4 t5)
	(west t5 t4)
	(east t5 t6)
	(west t6 t5)
	(east t6 t7)
	(west t7 t6)
	(east t7 t8)
	(west t8 t7)
	(east t8 t9)
	(west t9 t8)
	(east t9 goal_tile)
	(west goal_tile t9)
    (person person1)
    (at person1 start_tile)   
        )
(:goal 
    (and (at person1 goal_tile))
	)
)

; plan
1. (move-east person1 start_tile t0)
   deleted: (at person1 start_tile)
   added: (at person1 t0)
   goals met: 0 of 1
2. (move-east person1 t0 t1)
   deleted: (at person1 t0)
   added: (at person1 t1)
   goals met: 0 of 1
3. (move-east person1 t1 t2)
   deleted: (at person1 t1)
   added: (at person1 t2)
   goals met: 0 of 1
4. (move-east person1 t2 t3)
   deleted: (at person1 t2)
   added: (at person1 t3)
   goals met: 0 of 1
5. (move-east person1 t3 t4)
   deleted: (at person1 t3)
   added: (at person1 t4)
   goals met: 0 of 1
6. (move-east person1 t4 t5)
   deleted: (at person1 t4)
   added: (at person1 t5)
   goals met: 0 of 1
7. (move-east person1 t5 t6)
   deleted: (at person1 t5)
   added: (at person1 t6)
   goals met: 0 of 1
8. (move-east person1 t6 t7)
   deleted: (at person1 t6)
   added: (at person1 t7)
   goals met: 0 of 1
9. (move-east person1 t7 t8)
   deleted: (at person1 t7)
   added: (at person1 t8)
   goals met: 0 of 1
10. (move-east person1 t8 t9)
   deleted: (at person1 t8)
   added: (at person1 t9)
   goals met: 0 of 1
11. (move-east person1 t9 goal_tile)
   deleted: (at person1 t9)
   added: (at person1 goal_tile)
   goals met: 1 of 1
